app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "books".* FROM "books" LIMIT $1  [["LIMIT", 20]]
---
  def index
    @books = Book.all
    render json: @books.limit(20)

INSERT INTO "books" ("title", "author", "summary", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    @book.user = @current_user
    if @book.save

UPDATE "books" SET "image_url" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["image_url", "https://images-na.ssl-images-amazon.com/images/I/51CgK5tPG2L._SX308_BO1,204,203,200_.jpg"], ["updated_at", "2021-04-06 01:22:53.891713"], ["id", 18]]
---
  def update
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 1], ["id", nil], ["LIMIT", 1]]
---
    def set_book
      @book = @current_user.books.find(params[:id])