app/controllers/reviews_controller.rb

  def index
    @book = Book.find(params[:book_id])
    @reviews = Review.where(book_id: @book.id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 4]]

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("content", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["user_id", 7], ["book_id", 12], ["created_at", "2021-04-06 00:28:46.936702"], ["updated_at", "2021-04-06 00:28:46.936702"]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "content" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content", "testing testing 123456"], ["updated_at", "2021-04-05 01:38:55.068718"], ["id", 1]]